{
  "basics": {
    "name": "Colbren Fujimoto",
    "label": "Student",
    "picture": "https://github.com/colbren.png",
    "email": "colbren@hawaii.edu",
    "phone": "808-219-2079",
    "website": "https://colbren.github.io",
    "summary": "I am studying for a B.S. in Computer Engineering in the College of Engineering at the University of Hawaii. I expect to graduate in Spring, 2026. My current work involves robotic systems, satellites, and AI. I hope to work on embedded software for sensors on autonomous cars in the future.",
    "location": { "address": "", "postalCode": "96789", "city": "Mililani", "countryCode": "USA", "region": "Hawaii" },
    "profiles": [
      { "network": "github", "username": "colbren", "url": "http://github.com/colbren" },
      { "network": "linkedin", "username": "colbren", "url": "http://linkedin.com/in/colbren" },
      { "network": "twitter", "username": "colbrenf", "url": "http://twitter.com/colbrenf" },
      { "network": "instagram", "username": "colbren.f", "url": "http://instagram.com/colbren.f" }
    ]
  },

  "interests": [
    { "name": "Embedded Systems" },
    { "name": "Robotics" },
    { "name": "Artificial Intelligence" },
    { "name": "Small Satellites" },
    { "name": "Computer Vision" }
  ],

  "skills": [
    {
      "name": "Languages and Frameworks",
      "keywords": [ "C++", "Python", "C", "Java", "TypeScript" ]
    },
    {
      "name": "Toolsets",
      "keywords": [ "ROS2", "Git", "VSCode", "Linux", "SLAM", "YOLOv8", "DINO", "SAM2", "Sensor fusion" ]
    }
  ],

  "education": [
    {
      "institution": "University of Hawaii, Honolulu, HI",
      "area": "Computer Engineering (expected Spring, 2026)",
      "studyType": "B.S.",
      "startDate": "2023-08-16",
      "endDate": "Present",
      "courses": []
    }
  ],

  "work": [
    {
      "company": "Hawaii Space Flight Laboratory",
      "position": "Satellite Software Engineer",
      "website": "https://www.hsfl.hawaii.edu/",
      "startDate": "2024-11-01",
      "endDate": "Present",
      "summary": "Develop real-time embedded software for NASA-contracted satellite missions",
      "highlights": [
        "Developed and validated real-time embedded C++ software for NASA-contracted CubeSat missions, implementing robust control interfaces for EPS, ADCS, radio communication systems, and mission-critical onboard processes",
        "Collaborated with avionics and mechanical teams for end-to-end CubeSat integration, including subsystem bring-up, firmware deployment, configuration, hardware checkout, and comprehensive telemetry verification in flight-representative environments",
        "Developed automated tooling for data logging, test execution, and telemetry analysis, enabling efficient regression testing, rapid anomaly diagnosis, and improved mission readiness review workflows"
      ]
    },
    {
      "company": "Rainbow AI Security Lab",
      "position": "AI Research Assistant - Dr. Liuwan Zhu",
      "website": "",
      "startDate": "2025-01-13",
      "endDate": "Present",
      "summary": "Research in multimodal model safety, geolocation privacy, and medical AI",
      "highlights": [
        "Quantified the contribution of fine-grained geolocation cues in images processed by OpenAI’s multimodal models and developed an automated counterfactual defense framework that strategically obscures sensitive visual features while preserving overall visual semantics",
        "Developed a multimodal interpretability framework by integrating TokenSHAP and PixelSHAP to jointly analyze text and vision-based attribution patterns, enabling finer-grained measurement of how language cues and visual features interact during geolocation reasoning",
        "Applied tree-based feature importance methods and fine-tuned model parameters on specialized biomedical datasets to evaluate LLM-assisted lung cancer detection, achieving improved diagnostic performance using a Random Forest classifier"
      ]
    },
    {
      "company": "Robotic Space Exploration",
      "position": "GNC Lead Software Developer",
      "website": "",
      "startDate": "2023-11-01",
      "endDate": "Present",
      "summary": "Worked on autonomous navigation, computer vision, and ground station of rover simulating mars missions",
      "highlights": [
        "Developed a SLAM-driven autonomous path planner that optimized shortest-path routing and dynamic obstacle avoidance, improving exploration coverage efficiency by more than 40%",
        "Designed and implemented a high-precision sensor-fusion pipeline combining RTK-GNSS, IMU, and wheel-odometry data, improving positional accuracy from ~3 m to roughly 10 cm",
        "Leveraged a ZED 2i stereo camera with YOLOv8 for real-time object detection and ARUCO marker tracking, achieving over 90% detection accuracy in dynamic, real-world environments",
        "Placed 7th place out of 114 international teams in the Science Mission at the University Rover Challenge"
      ]
    }
  ],

  "volunteer": [
    {
      "organization": "Mililani Science Learning Center",
      "website": "",
      "position": "STEM Camp Lead",
      "startDate": "2019-10-01",
      "endDate": "2023-10-30",
      "summary": "Lead developer for weather sensing project",
      "highlights": [
        "Lead in providing mentorship for 3rd to 5th-grade students developing fundamental design principles and problem-solving skills through the engineering design process",
        "Created the curriculum for a LEGO Mindstorms EV3 robotics camp; designed engaging engineering-related activities and challenges"
      ]
    }
  ],

  "awards": [
    {
      "title": "Undergraduate Research Opportunities Program (UROP)",
      "date": "2023-11",
      "awarder": "University of Hawaii at Manoa",
      "summary": "Awarded $10,000 for research developing and testing autonomous navigation, control algorithms, and hardware integration for rover platforms to support future planetary exploration missions"
    },
    {
      "title": "Hawaii Space Grant Consortium (HSGC) Grant",
      "date": "2025-01",
      "awarder": "NASA / HSGC",
      "summary": "Secured $14,000 competitive grant to fund Team RoSE’s projects involving aerospace research"
    },
    {
      "title": "Dean’s List (All semesters)",
      "date": "2023–Present",
      "awarder": "University of Hawaiʻi at Mānoa",
      "summary": "Awarded for maintaining a semester GPA of 3.5 or higher"
    }
  ],

  "references": [
    { "name": "Available upon request" }
  ]
}
